import {AfterViewInit, Component, ElementRef, KeyValueDiffers, Type} from '@angular/core';

import * as _ from 'lodash';
import {filterExecutor} from '@core/filter/filter.executor';
import {session} from '@core/node/utils/session';

@Component({
  selector: 'app-root',
  templateUrl: './app.component.html',
  styleUrls: ['./app.component.less']
})
export class AppComponent implements AfterViewInit {
  title = 'app';

  constructor(private _elementRef: ElementRef, private _differs: KeyValueDiffers) {
    session.differs = _differs;
  }

  ngAfterViewInit() {
    // document.addEventListener('click', () => {
    //   console.log('document click');
    // });
    var users = [
      {'学校': '北京大学', '省份': '北京市', '城市': '北京市', '本科毕业生人数': '2645', '硕士毕业生人数': '3604', '博士毕业生人数': '1213', '毕业生人数': '7462'},
      {'学校': '北京航空航天大学', '省份': '北京市', '城市': '北京市', '本科毕业生人数': '3105', '硕士毕业生人数': '2845', '博士毕业生人数': '437', '毕业生人数': '6387'},
      {'学校': '北京理工大学', '省份': '北京市', '城市': '北京市', '本科毕业生人数': '3761', '硕士毕业生人数': '2818', '博士毕业生人数': '553', '毕业生人数': '7132'},
      {'学校': '北京师范大学', '省份': '北京市', '城市': '北京市', '本科毕业生人数': '2455', '硕士毕业生人数': '3476', '博士毕业生人数': '623', '毕业生人数': '6554'},
      {'学校': '大连理工大学', '省份': '辽宁省', '城市': '大连市', '本科毕业生人数': '5608', '硕士毕业生人数': '2689', '博士毕业生人数': '273', '毕业生人数': '8570'},
      {'学校': '电子科技大学', '省份': '四川省', '城市': '成都市', '本科毕业生人数': '4992', '硕士毕业生人数': '3433', '博士毕业生人数': '274', '毕业生人数': '8699'},
      {'学校': '东北大学', '省份': '辽宁省', '城市': '沈阳市', '本科毕业生人数': '4724', '硕士毕业生人数': '3219', '博士毕业生人数': '344', '毕业生人数': '8287'},
      {'学校': '东南大学', '省份': '江苏省', '城市': '南京市', '本科毕业生人数': '4101', '硕士毕业生人数': '3801', '博士毕业生人数': '1111', '毕业生人数': '9013'},
      {'学校': '复旦大学', '省份': '上海市', '城市': '上海市', '本科毕业生人数': '2789', '硕士毕业生人数': '3532', '博士毕业生人数': '1230', '毕业生人数': '7551'},
      {'学校': '哈尔滨工业大学', '省份': '黑龙江省', '城市': '哈尔滨市', '本科毕业生人数': '3974', '硕士毕业生人数': '3047', '博士毕业生人数': '538', '毕业生人数': '7559'},
      {'学校': '湖南大学', '省份': '湖南省', '城市': '长沙市', '本科毕业生人数': '4911', '硕士毕业生人数': '3129', '博士毕业生人数': '218', '毕业生人数': '8258'},
      {'学校': '中国科学技术大学', '省份': '安徽省', '城市': '合肥市', '本科毕业生人数': '1806', '硕士毕业生人数': '2835', '博士毕业生人数': '894', '毕业生人数': '5535'},
      {'学校': '中国农业大学', '省份': '北京市', '城市': '北京市', '本科毕业生人数': '2742', '硕士毕业生人数': '1716', '博士毕业生人数': '692', '毕业生人数': '5150'},
      {'学校': '中国人民大学', '省份': '北京市', '城市': '北京市', '本科毕业生人数': '3045', '硕士毕业生人数': '3400', '博士毕业生人数': '758', '毕业生人数': '7203'},
      {'学校': '中南大学', '省份': '湖南省', '城市': '长沙市', '本科毕业生人数': '7916', '硕士毕业生人数': '4375', '博士毕业生人数': '971', '毕业生人数': '13262'},
      {'学校': '中山大学', '省份': '广东省', '城市': '广州市', '本科毕业生人数': '6910', '硕士毕业生人数': '3666', '博士毕业生人数': '938', '毕业生人数': '11514'},
      {'学校': '重庆大学', '省份': '重庆市', '城市': '重庆市', '本科毕业生人数': '6758', '硕士毕业生人数': '3741', '博士毕业生人数': '455', '毕业生人数': '10954'},
      {'学校': '西北农林科技大学', '省份': '陕西省', '城市': '咸阳市', '本科毕业生人数': '5364', '硕士毕业生人数': '1941', '博士毕业生人数': '293', '毕业生人数': '7598'},
      {'学校': '中央民族大学', '省份': '北京市', '城市': '北京市', '本科毕业生人数': '2799', '硕士毕业生人数': '1229', '博士毕业生人数': '165', '毕业生人数': '4193'},

    ];
    console.log('*******************************', _.orderBy(users, ['user', 'age'], ['asc', 'asc']));

    const aaa = filterExecutor.execute(users, [{
      name: 'listFilter',
      config: {
        fieldName: '省份',
        list: ['江苏省', '上海市', '北京市', '天津市']
      }
    }, {
      name: 'textFilter',
      config: {
        fieldName: '省份',
        matchingType: 'some',
        list: [
          {
            text: '市',
            textFilterType: 'endWith'
          }
        ]
      }
    }, {
      name: 'sortFilter',
      config: [
        {
          fieldName: '毕业生人数'
        }
      ]
    }, {
      name: 'fieldFilter',
      config: {
        fieldNameList: ['学校', '毕业生人数']
      }
    }, {
      name: 'takeFilter',
      config: {
        takeType: 'begin',
        count: 5
      }
    }]);

    console.log(aaa);
  }
}
